tutorials/combustion/PDRFoam/flamePropagationWithObstacles/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1912                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

scale   1.0;

vertices
(
    (0.0  0.0 0.0)
    (1.0  0.0 0.0)
    (2.0  0.0 0.0)
    (3.0  0.0 0.0)
    (0.0  1.0 0.0)
    (1.0  1.0 0.0)
    (2.0  1.0 0.0)
    (3.0  1.0 0.0)
    (0.0  2.0 0.0)
    (1.0  2.0 0.0)
    (2.0  2.0 0.0)
    (3.0  2.0 0.0)
    (0.0  3.0 0.0)
    (1.0  3.0 0.0)
    (2.0  3.0 0.0)
    (3.0  3.0 0.0)
    (0.0  0.0 1.0)
    (1.0  0.0 1.0)
    (2.0  0.0 1.0)
    (3.0  0.0 1.0)
    (0.0  1.0 1.0)
    (1.0  1.0 1.0)
    (2.0  1.0 1.0)
    (3.0  1.0 1.0)
    (0.0  2.0 1.0)
    (1.0  2.0 1.0)
    (2.0  2.0 1.0)
    (3.0  2.0 1.0)
    (0.0  3.0 1.0)
    (1.0  3.0 1.0)
    (2.0  3.0 1.0)
    (3.0  3.0 1.0)
    (0.0  0.0 2.0)
    (1.0  0.0 2.0)
    (2.0  0.0 2.0)
    (3.0  0.0 2.0)
    (0.0  1.0 2.0)
    (1.0  1.0 2.0)
    (2.0  1.0 2.0)
    (3.0  1.0 2.0)
    (0.0  2.0 2.0)
    (1.0  2.0 2.0)
    (2.0  2.0 2.0)
    (3.0  2.0 2.0)
    (0.0  3.0 2.0)
    (1.0  3.0 2.0)
    (2.0  3.0 2.0)
    (3.0  3.0 2.0)
    (-3.53553390593274  -3.53553390593274 0)
    (-0.58113883008419  -4.74341649025257 0)
    (3.58113883008419  -4.74341649025257 0)
    (6.53553390593274  -3.53553390593274 0)
    (-4.74341649025257  -0.58113883008419 0)
    (-2.53553390593274  -2.53553390593274 0)
    (5.53553390593274  -2.53553390593274 0)
    (7.74341649025257  -0.58113883008419 0)
    (-4.74341649025257  3.58113883008419 0)
    (-2.53553390593274  5.53553390593274 0)
    (5.53553390593274  5.53553390593274 0)
    (7.74341649025257  3.58113883008419 0)
    (-3.53553390593274  6.53553390593274 0)
    (-0.58113883008419  7.74341649025257 0)
    (3.58113883008419  7.74341649025257 0)
    (6.53553390593274  6.53553390593274 0)
    (-3.19801074533416  -3.19801074533416 3.1320071635561)
    (-0.336306209562122  -4.00891862868637 3.67261241912424)
    (3.33630620956212  -4.00891862868637 3.67261241912424)
    (6.19801074533416  -3.19801074533416 3.1320071635561)
    (-4.00891862868637  -0.336306209562122 3.67261241912424)
    (7.00891862868637  -0.336306209562122 3.67261241912424)
    (-4.00891862868637  3.33630620956212 3.67261241912424)
    (7.00891862868637  3.33630620956212 3.67261241912424)
    (-3.19801074533416  6.19801074533416 3.1320071635561)
    (-0.336306209562122  7.00891862868637 3.67261241912424)
    (3.33630620956212  7.00891862868637 3.67261241912424)
    (6.19801074533416  6.19801074533416 3.1320071635561)
    (-2.57247877713763  -2.57247877713763 5.42997170285018)
    (0.0194193243090797  -2.94174202707276 5.92232270276368)
    (2.98058067569092  -2.94174202707276 5.92232270276368)
    (5.57247877713763  -2.57247877713763 5.42997170285018)
    (-2.94174202707276  0.0194193243090797 5.92232270276368)
    (-0.178511301977579  -0.178511301977579 6.71404520791032)
    (3.17851130197758  -0.178511301977579 6.71404520791032)
    (5.94174202707276  0.0194193243090797 5.92232270276368)
    (-2.94174202707276  2.98058067569092 5.92232270276368)
    (-0.178511301977579  3.17851130197758 6.71404520791032)
    (3.17851130197758  3.17851130197758 6.71404520791032)
    (5.94174202707276  2.98058067569092 5.92232270276368)
    (-2.57247877713763  5.57247877713763 5.42997170285018)
    (0.0194193243090797  5.94174202707276 5.92232270276368)
    (2.98058067569092  5.94174202707276 5.92232270276368)
    (5.57247877713763  5.57247877713763 5.42997170285018)
);

blocks
(
    hex  (0 1 5 4 16 17 21 20 ) (5 5 5) simpleGrading (1 1 1)
    hex  (1 2 6 5 17 18 22 21 ) (5 5 5) simpleGrading (1 1 1)
    hex  (2 3 7 6 18 19 23 22 ) (5 5 5) simpleGrading (1 1 1)
    hex  (4 5 9 8 20 21 25 24 ) (5 5 5) simpleGrading (1 1 1)
    hex  (5 6 10 9 21 22 26 25 ) (5 5 5) simpleGrading (1 1 1)
    hex  (6 7 11 10 22 23 27 26 )(5 5 5) simpleGrading (1 1 1)
    hex  (8 9 13 12 24 25 29 28 ) (5 5 5) simpleGrading (1 1 1)
    hex  (9 10 14 13 25 26 30 29 ) (5 5 5) simpleGrading (1 1 1)
    hex  (10 11 15 14 26 27 31 30 ) (5 5 5) simpleGrading (1 1 1)
    hex  (16 17 21 20 32 33 37 36 ) (5 5 5) simpleGrading (1 1 1)
    hex  (17 18 22 21 33 34 38 37 ) (5 5 5) simpleGrading (1 1 1)
    hex  (18 19 23 22 34 35 39 38 ) (5 5 5) simpleGrading (1 1 1)
    hex  (20 21 25 24 36 37 41 40 ) (5 5 5) simpleGrading (1 1 1)
    hex  (21 22 26 25 37 38 42 41 ) (5 5 5) simpleGrading (1 1 1)
    hex  (22 23 27 26 38 39 43 42 ) (5 5 5) simpleGrading (1 1 1)
    hex  (24 25 29 28 40 41 45 44 ) (5 5 5) simpleGrading (1 1 1)
    hex  (25 26 30 29 41 42 46 45 ) (5 5 5) simpleGrading (1 1 1)
    hex  (26 27 31 30 42 43 47 46 ) (5 5 5) simpleGrading (1 1 1)
    hex  (47 46 42 43 91 90 86 87) (5 5 7) simpleGrading (1 1 2.985984)
    hex  (46 45 41 42 90 89 85 86) (5 5 7) simpleGrading (1 1 2.985984)
    hex (45 44 40 41 89 88 84 85) (5 5 7) simpleGrading (1 1 2.985984)
    hex (43 42 38 39 87 86 82 83) (5 5 7) simpleGrading (1 1 2.985984)
    hex (42 41 37 38 86 85 81 82) (5 5 7) simpleGrading (1 1 2.985984)
    hex (41 40 36 37 85 84 80 81) (5 5 7) simpleGrading (1 1 2.985984)
    hex (39 38 34 35 83 82 78 79) (5 5 7) simpleGrading (1 1 2.985984)
    hex (38 37 33 34 82 81 77 78) (5 5 7) simpleGrading (1 1 2.985984)
    hex (37 36 32 33 81 80 76 77) (5 5 7) simpleGrading (1 1 2.985984)
    hex (0 16 20 4 48 64 68 52) (5 5 7) simpleGrading (1 1 2.985984)
    hex (16 32 36 20 64 76 80 68) (5 5 7) simpleGrading (1 1 2.985984)
    hex (4 20 24 8 52 68 70 56) (5 5 7) simpleGrading (1 1 2.985984)
    hex (20 36 40 24 68 80 84 70) (5 5 7) simpleGrading (1 1 2.985984)
    hex (8 24 28 12 56 70 72 60) (5 5 7) simpleGrading (1 1 2.985984)
    hex (24 40 44 28 70 84 88 72) (5 5 7) simpleGrading (1 1 2.985984)
    hex (47 43 27 31 91 87 71 75) (5 5 7) simpleGrading (1 1 2.985984)
    hex (43 39 23 27 87 83 69 71) (5 5 7) simpleGrading (1 1 2.985984)
    hex (39 35 19 23 83 79 67 69) (5 5 7) simpleGrading (1 1 2.985984)
    hex (31 27 11 15 75 71 59 63) (5 5 7) simpleGrading (1 1 2.985984)
    hex (27 23 7 11 71 69 55 59) (5 5 7) simpleGrading (1 1 2.985984)
    hex (23 19 3 7 69 67 51 55) (5 5 7) simpleGrading (1 1 2.985984)
    hex (0 1 17 16 48 49 65 64) (5 5 7) simpleGrading (1 1 2.985984)
    hex (1 2 18 17 49 50 66 65) (5 5 7) simpleGrading (1 1 2.985984)
    hex (2 3 19 18 50 51 67 66) (5 5 7) simpleGrading (1 1 2.985984)
    hex (16 17 33 32 64 65 77 76) (5 5 7) simpleGrading (1 1 2.985984)
    hex (17 18 34 33 65 66 78 77) (5 5 7) simpleGrading (1 1 2.985984)
    hex (18 19 35 34 66 67 79 78) (5 5 7) simpleGrading (1 1 2.985984)
    hex (47 31 30 46 91 75 74 90) (5 5 7) simpleGrading (1 1 2.985984)
    hex (31 15 14 30 75 63 62 74) (5 5 7) simpleGrading (1 1 2.985984)
    hex (46 30 29 45 90 74 73 89) (5 5 7) simpleGrading (1 1 2.985984)
    hex (30 14 13 29 74 62 61 73) (5 5 7) simpleGrading (1 1 2.985984)
    hex (45 29 28 44 89 73 72 88) (5 5 7) simpleGrading (1 1 2.985984)
    hex (29 13 12 28 73 61 60 72) (5 5 7) simpleGrading (1 1 2.985984)
);

boundary
(
    outer
    {
        type    patch;
        faces
        (
            (91 90 86 87)
            (90 89 85 86)
            (89 88 84 85)
            (87 86 82 83)
            (86 85 81 82)
            (85 84 80 81)
            (83 82 78 79)
            (82 81 77 78)
            (81 80 76 77)
            (48 64 68 52)
            (64 76 80 68)
            (52 68 70 56)
            (68 80 84 70)
            (56 70 72 60)
            (70 84 88 72)
            (91 87 71 75)
            (87 83 69 71)
            (83 79 67 69)
            (75 71 59 63)
            (71 69 55 59)
            (69 67 51 55)
            (48 49 65 64)
            (49 50 66 65)
            (50 51 67 66)
            (64 65 77 76)
            (65 66 78 77)
            (66 67 79 78)
            (91 75 74 90)
            (75 63 62 74)
            (90 74 73 89)
            (74 62 61 73)
            (89 73 72 88)
            (73 61 60 72)
        );
    }

    ground
    {
        type wall;
        faces
        (
            (0 4 5 1)
            (1 5 6 2)
            (2 6 7 3)
            (4 8 9 5)
            (5 9 10 6)
            (6 10 11 7)
            (8 12 13 9)
            (9 13 14 10)
            (10 14 15 11)
            (4 0 48 52)
            (8 4 52 56)
            (12 8 56 60)
            (11 15 63 59)
            (7 11 59 55)
            (3 7 55 51)
            (0 1 49 48)
            (1 2 50 49)
            (2 3 51 50)
            (15 14 62 63)
            (14 13 61 62)
            (13 12 60 61)
        );
    }

    blockedFaces
    {
        type wall;
        faces ();
    }

    baffleWall
    {
        type wall;
        faces ();
    }

    baffleCyclic_half0
    {
        type cyclic;
        neighbourPatch  baffleCyclic_half1;
        faces ();
    }

    baffleCyclic_half1
    {
        type cyclic;
        neighbourPatch  baffleCyclic_half0;
        faces ();
    }
);

// ************************************************************************* //
